#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.this will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "this" {
        id                                  = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS"
        name                                = "SINGLE_AKS"
        tags                                = {}
        # (34 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - max_surge = "10%" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_kubernetes_cluster_extension.this will be created
  + resource "azurerm_kubernetes_cluster_extension" "this" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS"
      + current_version       = (known after apply)
      + extension_type        = "microsoft.flux"
      + id                    = (known after apply)
      + name                  = "flux"
      + release_namespace     = (known after apply)
      + release_train         = (known after apply)
      + target_namespace      = (known after apply)
    }

  # azurerm_kubernetes_flux_configuration.this will be created
  + resource "azurerm_kubernetes_flux_configuration" "this" {
      + cluster_id                        = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS"
      + continuous_reconciliation_enabled = true
      + id                                = (known after apply)
      + name                              = "bootstrap"
      + namespace                         = "default"
      + scope                             = "namespace"

      + git_repository {
          + reference_type           = "branch"
          + reference_value          = "main"
          + sync_interval_in_seconds = 600
          + timeout_in_seconds       = 600
          + url                      = "https://github.com/iscahomd/flux-bootstrap.git"
        }

      + kustomizations {
          + depends_on                 = []
          + garbage_collection_enabled = false
          + name                       = "example"
          + path                       = "example"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 600
          + sync_interval_in_seconds   = 600
          + timeout_in_seconds         = 600
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @iscahomd, Action: `pull_request`, Workflow: `Terraform`*